Budget-tracker/app/controllers/budgets_controller.rb

SELECT "budgets".* FROM "budgets"
---
  def index
    @budgets = Budget.all

INSERT INTO "budgets" ("income", "house", "elec", "credit", "gas", "car", "insur", "water", "money", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @budget = Budget.new(budget_params)

    respond_to do |format|
      if @budget.save

SELECT  "budgets".* FROM "budgets" WHERE "budgets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_budget
      @budget = Budget.find(params[:id])